
#Область ОбработчикиСобытийФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.ГруппаИзмененияСпроса Тогда
		ЗаполнитьДиаграммуСпроса();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИзмененияСпроса

&НаКлиенте
Процедура ИзмененияСпросаПриИзменении(Элемент)
	ЗаполнитьДиаграммуСпроса();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыХодИгры
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РассчитатьРаунд(Команда)
	
	ТекущиеДанные = Элементы.ХодИгры.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьРаундСервер(ТекущиеДанные.НомерСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РассчитатьРаундСервер(НомерРаунда)
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.РассчитатьРаунд(НомерРаунда);
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиаграммуСпроса()
	
	ДинамикаСпроса.Очистить();
	
	Серия = ДинамикаСпроса.УстановитьСерию("Спрос");
	
	Спрос = Объект.НачальныйСпрос;
	
	Для Сч = 1 По Объект.КоличествоРаундов Цикл
		
		Фильтр = Новый Структура;
		Фильтр.Вставить("НомерРаунда", Сч);
		НайденныеСтроки = Объект.ИзмененияСпроса.НайтиСтроки(Фильтр);
		Для Каждого Строка Из НайденныеСтроки Цикл
			Спрос = Спрос + Строка.Изменение;			
		КонецЦикла;
		
		Точка = ДинамикаСпроса.УстановитьТочку(Сч);
		
		ДинамикаСпроса.УстановитьЗначение(Точка, Серия, Спрос);		
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьИгруНаСервере()
	
	ТелеграмПивнаяИгра.ЗапуститьИгру(Объект.Ссылка);
	
	ДокОбъект = Объект.Ссылка.ПолучитьОбъект();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьИгру(Команда)
	ЗапуститьИгруНаСервере();
КонецПроцедуры

#КонецОбласти


